+ 1. Цвета раскиданы по scss файлам - нехорошо это (добавыить правило для проекта)
+ 2. удалить лишнее (кнопки хедер, футер почистить)
3. при проходении коллекции добавить возможность (кнопку) отправить (скопировать) карточку в коллекци "Для повторения"
4. после прохождения коллекции выделять ее как "Пройдена"
4.2. добавить возможность снимать состояние "пройдена" (если есть желание пройти ее ещё)
5. в Коллекции "Для повторения" добавить кнопку удаления карточки из этой коллекции
6. добавить функционал выгрузки/загрузки результатов: 
 какие карточки коллекции пройдены
 на какой коллекции остановились, на какой карточке коллекции остановились
 (после успешной загрузки файла предложить перейти к этой карточки типа "продолжить?")
 а так же список карточек в коллекции "Для повторения"
 7. добавить описание приложения
 8. проверить как себя ведет на разных размерах мониторов
 9. добавить поддержку планшетов и телефонов
 10. добавить реальные данные для карточек
 11. глобальный рефакторинг компонентов (возможно добавить правила для проекта)
 12. выгрузить приложение на домен
 
 Дополнительно:
 1. Узнать как продвинуть сайт
 2. метрики: кто заходил, на сколько по времени
 3. добавит технологии современного React.
 4. lazy загрузку (видимо тут уже понадобится серверная часть)
